/* label of button to dismiss sheet without agreeing (Close rather than OK) */
"Close" = "Close";

/* primary label with product name */
"Connecting to %@..." = "Connecting to %@...";

/* primary label */
"Connecting..." = "Connecting...";

/*
 * Primary label displayed when app runs in "about box" mode.
 * Most of the time this is obscured by the sheet displaying the information
 * about the application.
 */
"PrimaryLabelAbout" = "About...";

//----- download progress info -----------------------------------------------//

/* No comment provided by engineer. */
"Downloading (%@ out of %@ Bytes)" = "Downloading (%1$@ out of %2$@ Bytes)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ KB)" = "Downloading (%1$@ out of %2$@ KB)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ MB)" = "Downloading (%1$@ out of %2$@ MB)";

//----- product display names ------------------------------------------------//

/** Name displayed in lieu of product when product is not known */
"UnknownTheProduct" = "the application";

/* G2M product display name */
"GoToMeeting" = "GoToMeeting";

/* G2T product display name */
"GoToTraining" = "GoToTraining";

/* G2W product display name */
"GoToWebinar" = "GoToWebinar";

/* G2A product display name */
"GoToAssist" = "GoToAssist";

/* G2AC product display name */
"GoToAssist Corporate" = "GoToAssist Corporate";

/* GoToMyPC product display name */
"GoToMyPC" = "GoToMyPC";

/* ShareConnect product display name */
"ShareConnect" = "ShareConnect";

//----- About Box ------------------------------------------------------------//


/* Message (title) displayed on face of about box sheet. */
"AboutBoxMessage" = "About GoTo Opener";

/* Detailed info displayed on face of about box sheet. */
"AboutBoxInfo" = "The GoTo Opener helps GoTo websites and software run smoothly on your computer.\n\nVersion: %@\n\nLocation: %@";


//----- task labels for main window ------------------------------------------//

/* generic launch progress label */
"Initializing" = "Initializing";

/*
 * Progress label displayed while just-launched, persistently-installed app
 * initially downloads session parameters from Launcher Service
 */
"DownloadingArgs" = "Requesting specific launch information";

/* progress label displayed while waiting for another DownloaderApp to finish */
"WaitingForMutex" = "Waiting for another GoTo Opener to complete";

/* progress label displayed while DownloaderApp installs itself to persistent location */
"InstallingDlApp" = "Installing GoTo Opener";

/* generic starting plugin download progress label */
"Starting Plugin Download" = "Starting Plugin Download";

/* generic installing plugin label */
"Installing Plugin" = "Installing Plugin";

/* generic starting download progress label */
"Starting Download" = "Starting Download";

/* generic downloading progress label */
"Downloading" = "Downloading";

/* generic verify archive progress label */
"Verifying" = "Verifying";

/* generic unarchiving progress label */
"Unzipping" = "Unzipping";

/* generic launch progress label */
"Installing" = "Installing";

/* generic launch progress label */
"Launching" = "Launching";

/* launch installer progress label */
"Launching Installer" = "Launching Installer";

//----- Message text for error alert sheets ----------------------------------//

/* download failed alert message */
"Download Failed" = "The download failed";

/* unarchive failed alert message */
"Unarchive Failed" = "Unarchive Failed";

/* installation failed alert message */
"Installation Failed" = "Installation Failed";

/* launch failed alert message */
"Launch Failed" = "Launch Failed";

//----- Info text for error alert sheets -------------------------------------//

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to launch app, into which specific product name is inserted */
"AppFatalMsgPre"  = "Unfortunately, the GoTo Opener wasn’t able to start %@.";

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to install package, into which specific product name is inserted */
"InstallFatalMsgPre"  = "Unfortunately, the GoTo Opener wasn’t able to install %@.";

/* boilerplate conclusion for error sheets indicating complete failure of the Launcher */
"GenericFatalMsgPost" = "Please restart the download or contact Global Customer Support at \nhttp://link.logmeininc.com/get-help.";

/* boilerplate introduction for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPre"  = "Unfortunately, the GoTo Opener cannot trust the download server.";

/* boilerplate conclusion for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPost" = "Please ensure you have updated trusted certificates in your keychains, or contact Global Customer Support at \nhttp://link.logmeininc.com/get-help.";

/* notify user that product endpoint version doesn't support OS version */
"ProductSupportForOsErrorInfo" = "The requested version of %@ does not support this version of Mac OS X.";

/* app download failed alert informative text */
"DownloadAppFailedErrorInfo" = "Failed to download the required application from our servers.";

/* app download failed alert instructions to manually download and install endpoint */
"DownloadAppFailedOfferManualDownload" = "%@ didn't start because there was a problem downloading the app. Save the file using your web browser instead:\n\n1. Click the ‘Download in Browser’ button.\n2. Open and install the downloaded file.\n3. Try to join your session again.";

/* app download failed alert instructions to manually download and install endpoint, post part */
"DownloadAppFailedOfferManualDownloadPost" = "For more help, contact your system administrator, or contact %@ support at \nhttps://link.logmeininc.com/get-help.";


/* app download failed alert download button */
"Download" = "Download in Browser";

/* installer download failed alert informative text */
"DownloadInstallerFailedErrorInfo" = "Failed to download the installer from our servers.";

/* app unarchive failed alert informative text */
"UnarchiveAppFailedErrorInfo" = "Failed to unarchive the required application.";

/* installer unarchive failed alert informative text */
"UnarchiveInstallerFailedErrorInfo" = "Failed to unarchive the installer.";

/* failed to place app bundle in permanent location, alert informative text */
"InstallAppFailedErrorInfo" = "Failed to install the required application.";

/* app launch failed alert informative text */
"LaunchAppFailedErrorInfo" = "Failed to launch the required application.";

/* installer launch failed alert informative text */
"LaunchInstallerFailedErrorInfo" = "Failed to launch the installer.";

/* app arguments download failed alert informative text */
"DownloadAppArgumentsFailedErrorInfo" = "Failed to download the required application arguments from our servers.";


//----- for SSL error alert sheets -------------------------------------------//

/* label of button to retry on authentication timeout (not abort the app) */
"AuthTimeoutErrorRetryButtonLabel" = "Retry";

/* label of button to cancel retry on authentication timeout (so abort the app) */
"AuthTimeoutErrorCancelButtonLabel" = "Close";

/* authentication timeout alert message */
"AuthTimeoutErrorMsg" = "Authentication took too long";

/* authentication timeout alert informative text */
"AuthTimeoutErrorInfo" = "Unable to authenticate credentials in reasonable time. Perhaps the name or password you submitted was not correct. Please try again.";

/* label of button to retry on connection lost during authentication (not abort the app) */
"AuthDisconnectErrorRetryButtonLabel" = "Retry";

/* label of button to cancel retry on connection lost during authentication (so abort the app) */
"AuthDisconnectErrorCancelButtonLabel" = "Close";

/* disconnect during authentication alert message */
"AuthDisconnectErrorMsg" = "Authentication failed";

/* disconnect during authentication alert informative text */
"AuthDisconnectErrorInfo" = "The network connection was lost unexpectedly while authenticating. Perhaps the name or password you submitted was not correct. Please try again.";

/* SSL server certificate error alert message */
"ServerSslCertErrorMsg" = "Server identity not trusted";

/* generic SSL server certificate error informative text */
"ServerSslCertError" = "The server's certificate appears invalid.  Connecting to the server could put your confidential information at risk.";

/* generic SSL server certificate error informative text <URL including host> */
"ServerSslCertErrorWithUrl" = "The certificate for the server in \'%@\' appears invalid.  Connecting to the server could put your confidential information at risk.";

/* generic SSL server certificate error informative text <host name> */
"ServerSslCertErrorWithHostName" = "The certificate for the server \'%@\' appears invalid.  Connecting to the server could put your confidential information at risk.";

/* label of button to close server certificate error dialog and abort the app */
"ServerCertErrorCancelButtonLabel" = "Close";
